LogicElements/fw-matterbridge/STM32/Core/src/app_entry.cpp
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * File Name          : app_entry.c
 * Description        : Entry application source file for STM32WPAN Middleware.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2019-2021 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Includes ------------------------------------------------------------------*/
#include "app_entry.h"
#include "app_ble.h"
#include "app_common.h"
#include "app_conf.h"
#include "app_debug.h"
#include "app_thread.h"
#include "cmsis_os.h"
#include "dbg_trace.h"
#include "hw_conf.h"
#include "main.h"
#include "shci.h"
#include "shci_tl.h"
#include "stm32_lpm.h"
#include "stm_logging.h"
#include "AppTask.h"
#include "STM32FreeRtosHooks.h"
#include "flash_wb.h"
#include "LED.h"
#include "LED_Animation.h"
#include "otp.h"
#include "stm_ext_flash.h"

#define POOL_SIZE (CFG_TLBLE_EVT_QUEUE_LENGTH * 4 * DIVC((sizeof(TL_PacketHeader_t) + TL_BLE_EVENT_FRAME_SIZE), 4))

extern RTC_HandleTypeDef hrtc; /**< RTC handler declaration */
#ifdef __cplusplus
extern "C" {
#endif

PLACE_IN_SECTION("MB_MEM2")
ALIGN(4)
static uint8_t EvtPool[POOL_SIZE];
PLACE_IN_SECTION("MB_MEM2")
ALIGN(4)
static TL_CmdPacket_t SystemCmdBuffer;
PLACE_IN_SECTION("MB_MEM2")
ALIGN(4)
static uint8_t SystemSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
PLACE_IN_SECTION("MB_MEM2")
ALIGN(4)
static uint8_t BleSpareEvtBuffer[sizeof(TL_PacketHeader_t) + TL_EVT_HDR_SIZE + 255];
uint8_t g_ot_notification_allowed = 0U;
/* Global variables ----------------------------------------------------------*/

/* Global function prototypes -----------------------------------------------*/
#if (CFG_DEBUG_TRACE != 0)
size_t DbgTraceWrite(int handle, const unsigned char* buf, size_t bufSize);
#endif

/* USER CODE BEGIN GFP */
osMutexId_t MtxShciId;
osSemaphoreId_t SemShciId;
osThreadId_t ShciUserEvtProcessId;
osThreadId_t OsPushButtonProcessId;

LED ledPower(0, LED::Effect::Breathing, 2500, 0, 100, 0);
LED ledCommissioning(1, LED::Effect::Off, 1000, 0, 0, 100);
LED ledIdentifier(2, LED::Effect::Off, 1000, 0, 190, 90);

#if (ENABLE_IWDG_SUPPORT == 1)
osThreadId_t OsIWDSBSFUId;
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

const osThreadAttr_t ShciUserEvtProcess_attr = {
	.name = CFG_SHCI_USER_EVT_PROCESS_NAME,
	.attr_bits = CFG_SHCI_USER_EVT_PROCESS_ATTR_BITS,
	.cb_mem = CFG_SHCI_USER_EVT_PROCESS_CB_MEM,
	.cb_size = CFG_SHCI_USER_EVT_PROCESS_CB_SIZE,
	.stack_mem = CFG_SHCI_USER_EVT_PROCESS_STACK_MEM,
	.stack_size = CFG_SHCI_USER_EVT_PROCESS_STACK_SIZE,
	.priority = CFG_SHCI_USER_EVT_PROCESS_PRIORITY
};

const osThreadAttr_t PushButtonProcess_attr = {
	.name = CFG_PUSH_BUTTON_EVT_PROCESS_NAME,
	.attr_bits = CFG_PUSH_BUTTON_EVT_PROCESS_ATTR_BITS,
	.cb_mem = CFG_PUSH_BUTTON_EVT_PROCESS_CB_MEM,
	.cb_size = CFG_PUSH_BUTTON_EVT_PROCESS_CB_SIZE,
	.stack_mem = CFG_PUSH_BUTTON_EVT_PROCESS_STACK_MEM,
	.stack_size = CFG_PUSH_BUTTON_EVT_PROCESS_STACK_SIZE,
	.priority = CFG_PUSH_BUTTON_EVT_PROCESS_PRIORITY
};

#if (ENABLE_IWDG_SUPPORT == 1)
const osThreadAttr_t IWDSBSFU_attr = {
	.name = CFG_IWD_SBSFU_EVT_PROCESS_NAME,
	.attr_bits = CFG_IWD_SBSFU_EVT_PROCESS_ATTR_BITS,
	.cb_mem = CFG_IWD_SBSFU_EVT_PROCESS_CB_MEM,
	.cb_size = CFG_IWD_SBSFU_EVT_PROCESS_CB_SIZE,
	.stack_mem = CFG_IWD_SBSFU_EVT_PROCESS_STACK_MEM,
	.stack_size = CFG_IWD_SBSFU_EVT_PROCESS_STACK_SIZE,
	.priority = CFG_IWD_SBSFU_EVT_PROCESS_PRIORITY
};
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

/* USER CODE END GFP */

/* Private functions prototypes-----------------------------------------------*/
static void Reset_Device(void);
#if (CFG_HW_RESET_BY_FW == 1)
static void Reset_BackupDomain(void);
static void Reset_IPCC(void);
#endif /* CFG_HW_RESET_BY_FW == 1*/
static void Config_HSE(void);

static void System_Init(void);
static void Init_Smps(void);
static void Init_Exti(void);
static void Init_Rtc(void);

static void SystemPower_Config(void);
static void appe_Tl_Init(void);
static void APPE_SysStatusNot(SHCI_TL_CmdStatus_t status);
static void APPE_SysUserEvtRx(void* pPayload);
static void APPE_SysEvtReadyProcessing(void);
static void APPE_SysEvtError(SCHI_SystemErrCode_t ErrorCode);
static void Init_Debug(void);

static void ShciUserEvtProcess(void* argument);
static void LEDProcess(void* argument);

#if (ENABLE_IWDG_SUPPORT == 1)
static void IWDSBSFUEvtProcess(void* argument);
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

/* USER CODE BEGIN PFP */
#if (CFG_HW_EXTPA_ENABLED == 1)
static void ExtPA_Init(void);
#endif
/* USER CODE END PFP */

/* Functions Definition ------------------------------------------------------*/
void APPE_Config(void)
{
	/**
	 * The OPTVERR flag is wrongly set at power on
	 * It shall be cleared before using any HAL_FLASH_xxx() api
	 */
	__HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_OPTVERR);

	/**
	 * Reset some configurations so that the system behave in the same way
	 * when either out of nReset or Power On
	 */
	Reset_Device();

	/* Configure HSE Tuning */
	Config_HSE();

	return;
}

void APPE_Init(void)
{
#if (ENABLE_IWDG_SUPPORT == 1)
	/* Reconfigure IWDG for user application usage.
	 * The SecureBoot (if used) configured the IWDG for its own purpose.
	 * Once running, IWDG cannot be stopped. UserApp must refresh it periodically before it causes a reset.
	 * We re-use IWDG to monitor application crashes, but we need to increase IWDG counter value.
	 * As IWDG registers are protected, it is required first to write a specific value in the KR register.
	 *   LSI_freq = 32000 Hz
	 *   IWDG prescaler (IWDG_PR) is applied to LSI.
	 *   Reload register (IWDG_RLR) is a 12-bit register (maximum value = 0xFFF).
	 *   IWDG timeout = IWDG_RSR * IWDG_PR / 32000
	 * Settings for a 25 sec timeout :
	 */
	WRITE_REG(IWDG->KR, IWDG_KEY_WRITE_ACCESS_ENABLE); /* enable modification of IWDG registers */
	WRITE_REG(IWDG->PR, IWDG_PRESCALER_256);
	WRITE_REG(IWDG->RLR, 0xC35);
	/* refresh the IWDG */
	WRITE_REG(IWDG->KR, IWDG_KEY_RELOAD);
#endif /* (ENABLE_IWDG_SUPPORT == 1)  */

	freertos_mbedtls_init();

	/* < System initialization */
	System_Init();

	/* Configure the system Power Mode */
	SystemPower_Config();

	/* Initialize the TimerServer */
	HW_TS_Init(hw_ts_InitMode_Full, &hrtc);

	/* USER CODE BEGIN APPE_Init_1 */
	/* initialize debugger module if supported and debug trace if activated */
	Init_Debug();

	/* FLASH init */
	STM_EXT_FLASH_Init();

	//STM_EXT_FLASH_Delete_Image(0x90000000U, 4096 * 6);

	NM_Init();

	APP_DBG("FW info :");
	APP_DBG("**********************************************************");
	APP_DBG("PRODUCT NAME : " PRODUCT_NAME);
	APP_DBG("VENDOR NAME : " VENDOR_NAME);
	APP_DBG("HARDWARE : MatterBridge rev. 1");
	APP_DBG("SOFTWARE : X-CUBE-MATTER release revision " X_CUBE_MATTER_VERSION);
	APP_DBG("Embedded SW components :");
	APP_DBG("- Matter SDK version : " MATTER_SDK_VERSION);


	/* init CPU2 debug */
	APPD_Init();

	/**
	 * The Standby mode should not be entered before the initialization is over
	 * The default state of the Low Power Manager is to allow the Standby Mode so an request is needed here
	 */
	UTIL_LPM_SetOffMode(1 << CFG_LPM_APP, UTIL_LPM_DISABLE);

	// OsPushButtonProcessId = osThreadNew(LEDProcess, NULL, &PushButtonProcess_attr);
#if (ENABLE_IWDG_SUPPORT == 1)
	OsIWDSBSFUId = osThreadNew(IWDSBSFUEvtProcess, NULL, &IWDSBSFU_attr);
#endif /* (ENABLE_IWDG_SUPPORT == 1) */

	/* USER CODE END APPE_Init_1 */
	/* Initialize all transport layers and start CPU2 which will send back a ready event to CPU1 */
	appe_Tl_Init();

	/**
	 * From now, the application is waiting for the ready event ( VS_HCI_C2_Ready )
	 * received on the system channel before starting the Stack
	 * This system event is received with APPE_SysUserEvtRx()
	 */
	/* USER CODE BEGIN APPE_Init_2 */
#if (CFG_HW_EXTPA_ENABLED == 1)
	ExtPA_Init();
#endif

	/* USER CODE END APPE_Init_2 */
	return;
}

/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/
static void Reset_Device(void)
{
#if (CFG_HW_RESET_BY_FW == 1)
	Reset_BackupDomain();

	Reset_IPCC();
#endif

	return;
}

#if (CFG_HW_RESET_BY_FW == 1)
static void Reset_BackupDomain(void)
{
	if ((LL_RCC_IsActiveFlag_PINRST() != FALSE) && (LL_RCC_IsActiveFlag_SFTRST() == FALSE))
	{
		HAL_PWR_EnableBkUpAccess(); /**< Enable access to the RTC registers */

		/**
		 *  Write twice the value to flush the APB-AHB bridge
		 *  This bit shall be written in the register before writing the next one
		 */
		HAL_PWR_EnableBkUpAccess();

		__HAL_RCC_BACKUPRESET_FORCE();
		__HAL_RCC_BACKUPRESET_RELEASE();
	}

	return;
}

static void Reset_IPCC(void)
{
	LL_AHB3_GRP1_EnableClock(LL_AHB3_GRP1_PERIPH_IPCC);

	LL_C1_IPCC_ClearFlag_CHx(IPCC, LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_ClearFlag_CHx(IPCC, LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableTransmitChannel(IPCC, LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableTransmitChannel(IPCC, LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C1_IPCC_DisableReceiveChannel(IPCC, LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	LL_C2_IPCC_DisableReceiveChannel(IPCC, LL_IPCC_CHANNEL_1 | LL_IPCC_CHANNEL_2 | LL_IPCC_CHANNEL_3 | LL_IPCC_CHANNEL_4 | LL_IPCC_CHANNEL_5 | LL_IPCC_CHANNEL_6);

	return;
}
#endif /* CFG_HW_RESET_BY_FW == 1 */

static void Config_HSE(void)
{
	OTP_ID0_t* p_otp;

	/**
	 * Read HSE_Tuning from OTP
	 */
	p_otp = (OTP_ID0_t*)OTP_Read(0);
	if (p_otp)
	{
		LL_RCC_HSE_SetCapacitorTuning(p_otp->hse_tuning);
	}

	return;
}

static void System_Init(void)
{
	Init_Smps();

	Init_Exti();

	Init_Rtc();

	return;
}

static void Init_Smps(void)
{
#if (CFG_USE_SMPS != 0)
	/**
	 *  Configure and enable SMPS
	 *
	 *  The SMPS configuration is not yet supported by CubeMx
	 *  when SMPS output voltage is set to 1.4V, the RF output power is limited to 3.7dBm
	 *  the SMPS output voltage shall be increased for higher RF output power
	 */
	LL_PWR_SMPS_SetStartupCurrent(LL_PWR_SMPS_STARTUP_CURRENT_80MA);
	LL_PWR_SMPS_SetOutputVoltageLevel(LL_PWR_SMPS_OUTPUT_VOLTAGE_1V40);
	LL_PWR_SMPS_Enable();
#endif /* CFG_USE_SMPS != 0 */

	return;
}

static void Init_Exti(void)
{
	/* Enable IPCC(36), HSEM(38) wakeup interrupts on CPU1 */
	// LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_36 | LL_EXTI_LINE_38);

	/* Disable all wakeup interrupt on CPU1  except LPUART(25), IPCC(36), HSEM(38) */
	LL_EXTI_DisableIT_0_31((~0) & (~(LL_EXTI_LINE_25)));
	LL_EXTI_DisableIT_32_63((~0) & (~(LL_EXTI_LINE_36 | LL_EXTI_LINE_38)));
	return;
}

static void Init_Rtc(void)
{
	/* Disable RTC registers write protection */
	LL_RTC_DisableWriteProtection(RTC);

	LL_RTC_WAKEUP_SetClock(RTC, CFG_RTC_WUCKSEL_DIVIDER);

	/* Enable RTC registers write protection */
	LL_RTC_EnableWriteProtection(RTC);

	return;
}

static void Init_Debug(void)
{
#if (CFG_DEBUGGER_SUPPORTED == 1)
	/**
	 * Keep debugger enabled while in any low power mode
	 */
	HAL_DBGMCU_EnableDBGSleepMode();

	/* Enable debugger EXTI lines */
	LL_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);
	LL_C2_EXTI_EnableIT_32_63(LL_EXTI_LINE_48);

#else
	/* Disable debugger EXTI lines */
	LL_EXTI_DisableIT_32_63(LL_EXTI_LINE_48);
	LL_C2_EXTI_DisableIT_32_63(LL_EXTI_LINE_48);

	GPIO_InitTypeDef gpio_config = {0};

	gpio_config.Pull = GPIO_NOPULL;
	gpio_config.Mode = GPIO_MODE_ANALOG;

	gpio_config.Pin = GPIO_PIN_15 | GPIO_PIN_14 | GPIO_PIN_13;
	__HAL_RCC_GPIOA_CLK_ENABLE();
	HAL_GPIO_Init(GPIOA, &gpio_config);
	__HAL_RCC_GPIOA_CLK_DISABLE();

	gpio_config.Pin = GPIO_PIN_4 | GPIO_PIN_3;
	__HAL_RCC_GPIOB_CLK_ENABLE();
	HAL_GPIO_Init(GPIOB, &gpio_config);
	__HAL_RCC_GPIOB_CLK_DISABLE();

	/**
	 * Do not keep debugger enabled while in any low power mode
	 */
	HAL_DBGMCU_DisableDBGSleepMode();
	HAL_DBGMCU_DisableDBGStopMode();
	HAL_DBGMCU_DisableDBGStandbyMode();
#endif /* (CFG_DEBUGGER_SUPPORTED == 1) */

#if (CFG_DEBUG_TRACE != 0)
	DbgTraceInit();
#endif

	return;
}

/**
 * @brief  Configure the system for power optimization
 *
 * @note  This API configures the system to be ready for low power mode
 *
 * @param  None
 * @retval None
 */
static void SystemPower_Config(void)
{
	// Before going to stop or standby modes, do the settings so that system clock and IP80215.4 clock
	// start on HSI automatically
	LL_RCC_HSI_EnableAutoFromStop();

	/**
	 * Select HSI as system clock source after Wake Up from Stop mode
	 */
	LL_RCC_SetClkAfterWakeFromStop(LL_RCC_STOP_WAKEUPCLOCK_HSI);

	/* Initialize low power manager */
	UTIL_LPM_Init();

	/* Disable low power mode until INIT is complete */
	UTIL_LPM_SetOffMode(1 << CFG_LPM_APP, UTIL_LPM_DISABLE);
	UTIL_LPM_SetStopMode(1 << CFG_LPM_APP, UTIL_LPM_DISABLE);

	/* Enable RAM1 (because OT instance.o is located here for Concurrent Mode */
	LL_C2_AHB1_GRP1_EnableClock(LL_C2_AHB1_GRP1_PERIPH_SRAM1);
	LL_C2_AHB1_GRP1_EnableClockSleep(LL_C2_AHB1_GRP1_PERIPH_SRAM1);

	return;
}

static void appe_Tl_Init(void)
{
	/**< Reference table initialization */
	TL_Init();

	MtxShciId = osMutexNew(NULL);
	SemShciId = osSemaphoreNew(1, 0, NULL); /*< Create the semaphore and make it busy at initialization */

	/** FreeRTOS system task creation */
	ShciUserEvtProcessId = osThreadNew(ShciUserEvtProcess, NULL, &ShciUserEvtProcess_attr);

	return;
}

static void APPE_SysStatusNot(SHCI_TL_CmdStatus_t status)
{
	switch (status)
	{
		case SHCI_TL_CmdBusy:
			osMutexAcquire(MtxShciId, osWaitForever);
			break;

		case SHCI_TL_CmdAvailable:
			osMutexRelease(MtxShciId);
			break;

		default:
			break;
	}
	return;
}

/**
 * The type of the payload for a system user event is tSHCI_UserEvtRxParam
 * When the system event is both :
 *    - a ready event (subevtcode = SHCI_SUB_EVT_CODE_READY)
 *    - reported by the FUS (sysevt_ready_rsp == FUS_FW_RUNNING)
 * The buffer shall not be released
 * ( eg ((tSHCI_UserEvtRxParam*)pPayload)->status shall be set to SHCI_TL_UserEventFlow_Disable )
 * When the status is not filled, the buffer is released by default
 */
static void APPE_SysUserEvtRx(void* pPayload)
{
	TL_AsynchEvt_t* p_sys_event;
	p_sys_event = (TL_AsynchEvt_t*)(((tSHCI_UserEvtRxParam*)pPayload)->pckt->evtserial.evt.payload);

	switch (p_sys_event->subevtcode)
	{
		case SHCI_SUB_EVT_CODE_READY:
			APPE_SysEvtReadyProcessing();
			break;

		case SHCI_SUB_EVT_ERROR_NOTIF:
			APPE_SysEvtError((SCHI_SystemErrCode_t)(p_sys_event->payload[0]));
			break;

		default:
			break;
	}
	return;
}

/**
 * @brief Notify a system error coming from the M0 firmware
 * @param  ErrorCode  : errorCode detected by the M0 firmware
 *
 * @retval None
 */
static void APPE_SysEvtError(SCHI_SystemErrCode_t ErrorCode)
{
	switch (ErrorCode)
	{
		case ERR_THREAD_LLD_FATAL_ERROR:
			APP_DBG("** ERR_THREAD : LLD_FATAL_ERROR \n");
			break;

		case ERR_THREAD_UNKNOWN_CMD:
			APP_DBG("** ERR_THREAD : UNKNOWN_CMD \n");
			break;

		default:
			APP_DBG("** ERR_THREAD : ErroCode=%d \n", ErrorCode);
			break;
	}
	return;
}

static void APPE_SysEvtReadyProcessing(void)
{
	/* Traces channel initialization */
	APPD_EnableCPU2();

	/* Configuration to CPU2 */
	SHCI_C2_CONFIG_Cmd_Param_t config_param = {0};
	uint32_t Ot_NVMAddr = 0;

	/* In the Context of Dynamic Concurrent mode, the Init and start of each stack must be split and executed
	 * in the following order :
	 * APP_BLE_Init_Dyn_1()    : BLE Stack Init until it's ready to start ADV
	 * APP_THREAD_Init_Dyn_1() : Thread Stack Init until it's ready to be configured (default channel, PID, etc...)
	 * APP_THREAD_Init_Dyn_2() : Thread Stack configuration (default channel, PID, etc...) to be able to start scanning
	 *                           or joining a Thread Network
	 */

	APP_THREAD_CheckWirelessFirmwareInfo();

	/* Set the address that will be used by OT stack for NVM data management */
	if (NM_GetOtNVMAddr(&Ot_NVMAddr) == NVM_OK)
	{
		config_param.ThreadNvmRamAddress = Ot_NVMAddr;
		(void)SHCI_C2_Config(&config_param);
	}

	APP_DBG("1- Initialisation of BLE Stack...");
	APP_BLE_Init_Dyn_1();

	APP_DBG("2- Initialisation of OpenThread Stack...");
	APP_THREAD_Init_Dyn_1();
	APP_THREAD_Init_Dyn_2();

	APP_DBG("* GetAppTask().InitMatter();*");
	GetAppTask().InitMatter();

	APP_DBG("* GetAppTask().StartAppTask();*");
	GetAppTask().StartAppTask();

	APP_DBG("Initialisation finished");

#if (CFG_LPM_SUPPORTED == 1)
	/* Thread stack is initialized, low power mode can be enabled */
	UTIL_LPM_SetOffMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
	UTIL_LPM_SetStopMode(1U << CFG_LPM_APP, UTIL_LPM_ENABLE);
#endif

	return;
}

#if (CFG_HW_EXTPA_ENABLED == 1)
static void ExtPA_Init(void)
{
	GPIO_InitTypeDef GPIO_InitStruct;

	// configure the GPIO PB0 in AF6 to be used as RF_TX_MOD_EXT_PA
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF6_RF_DTB0;
	GPIO_InitStruct.Pin = GPIO_EXT_PA_TX_PIN;
	HAL_GPIO_Init(GPIO_EXT_PA_TX_PORT, &GPIO_InitStruct);

	// configure the GPIO which will be managed by M0 stack to enable Ext PA
	GPIO_InitStruct.Pull = GPIO_NOPULL;
	GPIO_InitStruct.Mode = GPIO_MODE_OUTPUT_PP;
	GPIO_InitStruct.Speed = GPIO_SPEED_FREQ_VERY_HIGH;
	GPIO_InitStruct.Pin = GPIO_EXT_PA_EN_PIN;
	HAL_GPIO_Init(GPIO_EXT_PA_EN_PORT, &GPIO_InitStruct);

	// Indicate to M0 which GPIO must be managed
	SHCI_C2_ExtpaConfig((uint32_t)GPIO_EXT_PA_EN_PORT, GPIO_EXT_PA_EN_PIN, EXT_PA_ENABLED_HIGH, EXT_PA_ENABLED);
}
#endif /* CFG_HW_EXTPA_ENABLED */

/*************************************************************
 *
 * WRAP FUNCTIONS
 *
 *************************************************************/

static void LEDProcess(void* argument)
{
	UNUSED(argument);

	while (true)
	{
		// ledPower.Update();
		// ledCommissioning.Update();
		// ledIdentifier.Update();
		//
		// if (LED::dirty)
		// {
		// 	LED_Send();
		// 	LED::dirty = false;
		// }
	}
}

static void ShciUserEvtProcess(void* argument)
{
	UNUSED(argument);

	TL_MM_Config_t tl_mm_config;
	SHCI_TL_HciInitConf_t SHci_Tl_Init_Conf;

	/**< System channel initialization */
	SHci_Tl_Init_Conf.p_cmdbuffer = (uint8_t*)&SystemCmdBuffer;
	SHci_Tl_Init_Conf.StatusNotCallBack = APPE_SysStatusNot;
	shci_init(APPE_SysUserEvtRx, (void*)&SHci_Tl_Init_Conf);

	/**< Memory Manager channel initialization */
	tl_mm_config.p_BleSpareEvtBuffer = BleSpareEvtBuffer;
	tl_mm_config.p_SystemSpareEvtBuffer = SystemSpareEvtBuffer;
	tl_mm_config.p_AsynchEvtPool = EvtPool;
	tl_mm_config.AsynchEvtPoolSize = POOL_SIZE;
	TL_MM_Init(&tl_mm_config);

	TL_Enable();

	for (;;)
	{
		/* USER CODE BEGIN SHCI_USER_EVT_PROCESS_1 */

		/* USER CODE END SHCI_USER_EVT_PROCESS_1 */
		osThreadFlagsWait(1, osFlagsWaitAny, osWaitForever);

		shci_user_evt_proc();
		/* USER CODE BEGIN SHCI_USER_EVT_PROCESS_2 */

		/* USER CODE END SHCI_USER_EVT_PROCESS_2 */
	}
}

#if (ENABLE_IWDG_SUPPORT == 1)
static void IWDSBSFUEvtProcess(void* argument)
{
	TickType_t xLastWakeTime;
	// Initialise the xLastWakeTime variable with the current time.
	xLastWakeTime = xTaskGetTickCount();

	for (;;)
	{
		// Wait for the next cycle.
		vTaskDelayUntil(&xLastWakeTime, IWD_RELOAD);
		/* If the SecureBoot configured the IWDG, UserApp must reload IWDG counter with
		 * value defined in the reload register. */
		WRITE_REG(IWDG->KR, IWDG_KEY_RELOAD);
	}
}
#endif /* (ENABLE_IWDG_SUPPORT == 1)  */

void shci_notify_asynch_evt(void* pdata)
{
	UNUSED(pdata);

	osThreadFlagsSet(ShciUserEvtProcessId, 1);
	return;
}

void shci_cmd_resp_release(uint32_t flag)
{
	UNUSED(flag);
	osSemaphoreRelease(SemShciId);
	return;
}

void shci_cmd_resp_wait(uint32_t timeout)
{
	osSemaphoreAcquire(SemShciId, pdMS_TO_TICKS(timeout));
	return;
}

/* Received trace buffer from M0 */
void TL_TRACES_EvtReceived(TL_EvtPacket_t* hcievt)
{
#if (CFG_DEBUG_TRACE != 0)
	/* Call write/print function using DMA from dbg_trace */
	/* - Cast to TL_AsynchEvt_t* to get "real" payload (without Sub Evt code 2bytes),
	 - (-2) to size to remove Sub Evt Code */
	DbgTraceWrite(1U, (const unsigned char*)((TL_AsynchEvt_t*)(hcievt->evtserial.evt.payload))->payload, hcievt->evtserial.evt.plen - 2U);
#endif /* CFG_DEBUG_TRACE */
	/* Release buffer */
	TL_MM_EvtDone(hcievt);
}

/**
 * @brief  Initialization of the trace mechanism
 * @param  None
 * @retval None
 */
#if (CFG_DEBUG_TRACE != 0)
void DbgOutputInit(void)
{
	return;
}

/**
 * @brief  Management of the traces
 * @param  p_data : data
 * @param  size : size
 * @param  call-back :
 * @retval None
 */
void DbgOutputTraces(uint8_t* p_data, uint16_t size, void (*cb)(void))
{
	return;
}
#endif

#ifdef __cplusplus
}
#endif